using DirectoryService.Core.LocationsContext.ValueObjects;
using ResultLibrary;

namespace DirectoryService.Tests.Locations;

public class LocationAddressTests
{
    private static readonly IEnumerable<string[]> ValidInputWords =
    [
        ["Краснодарский край", "г. Краснодар", "ул. Пушкина", "д. Колотушкина"],
        ["Московская область", "город Москва", "улица Тверская", "дом 13"],
        ["Ленинградская область", "г. Санкт-Петербург", "проспект Невский", "д. 25"],
        ["Краснодарский край", "г. Краснодар", "ул. Красная", "д. 100"],
        ["Свердловская область", "город Екатеринбург", "бульвар Ленина", "дом 5А"],
        ["Новосибирская область", "г. Новосибирск", "переулок Садовый", "корпус 3"],
        ["Томская область", "город Томск", "шоссе Московское", "строение 7"],
        ["Московская область", "посёлок Жаворонки", "СНТ «Рассвет»", "д. 12"],
        ["Ленинградская область", "деревня Марьино", "днп «Зелёный угол»", "дом 5Б"],
        ["Ростовская область", "г. Ростов-на-Дону", "микрорайон 12", "д. 45"],
        ["Кемеровская область", "город Кемерово", "мкр. Центральный", "корп. 2"],
        ["Самарская область", "г. Самара", "аллея Славы", "владение 8"],
        ["Калининградская область", "город Калининград", "улица Багратиона", "литера А"],
        ["Челябинская область", "г. Челябинск", "пр. Победы", "д. 15В"],
        ["Воронежская область", "город Воронеж", "ул. Лизюкова", "к. 10Г"],
    ];

    [Fact]
    private void Create_Location_Address_Success()
    {
        foreach (string[] inputs in ValidInputWords)
        {
            Result<LocationAddress> address = LocationAddress.Create(inputs);
            Assert.True(address.IsSuccess);
        }
    }
}
